app/controllers/comments_controller.rb

	  def index
    post_id = params[:post_id]
    @post = Post.find(post_id)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def new
    post_id = params[:post_id]
    @post = Post.find(post_id)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]