app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @all_posts = Post.all

INSERT INTO "posts" ("author", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author", "hi"], ["created_at", "2014-08-21 00:51:53.965342"], ["title", "hi"], ["updated_at", "2014-08-21 00:51:53.965342"]]
---
  def create
    post_data = params[:post].permit(:author, :title, :description)
    tag_data = params[:tags].split(",").map(&:strip).map(&:downcase)

    post = Post.create(post_data)

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
  def destroy
    id = params[:id]
    post = Post.find(id)
    post.destroy